Tekla.Structures.PluginsInternal.DelegateFake
Implements ICDelegate so that every method throws NotImplementedException.
Can be used in unit testing to mock Tekla Structures behavior, by setting
a ICDelegate instance using Tekla.Structures.TeklaStructuresInternal.CDelegateSetter.